TESTE_FUNCIONAL_10032025-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: TESTE FUNCIONAL 10032025-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: TESTE FUNCIONAL 10032025-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  TESTE FUNCIONAL 10032025-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1440,765)
      - go(https://blazedemo.com/index.php)
      - waitForCSS(input.btn.btn-primary): "Clickable"
      - clickByCSS(input.btn.btn-primary)
    - label: escolhendo destino
      actions:
      - waitForCSS(input.btn.btn-small): "Clickable"
      - clickByCSS(input.btn.btn-small)
      - waitForCSS(body > div.container): "Clickable"
      - clickByCSS(body > div.container)
    - label: colocando informações de compra
      actions:
      - waitForID(inputName): "Clickable"
      - clickByID(inputName)
      - waitForID(inputName): "Clickable"
      - typeByID(inputName): "kayke"
      - waitForID(address): "Clickable"
      - clickByID(address)
      - waitForID(city): "Clickable"
      - clickByID(city)
      - waitForID(address): "Clickable"
      - clickByID(address)
      - waitForID(address): "Clickable"
      - typeByID(address): "123 main salin"
      - waitForID(city): "Clickable"
      - clickByID(city)
      - waitForID(city): "Clickable"
      - typeByID(city): "kapolos"
      - waitForID(state): "Clickable"
      - clickByID(state)
      - waitForID(state): "Clickable"
      - typeByID(state): "unidos fabios"
      - waitForID(zipCode): "Clickable"
      - clickByID(zipCode)
      - waitForID(zipCode): "Clickable"
      - typeByID(zipCode): "9998"
      - waitForID(cardType): "Clickable"
      - clickByID(cardType)
      - waitForID(cardType): "Clickable"
      - selectByID(cardType): "American Express"
      - waitForID(creditCardNumber): "Clickable"
      - clickByID(creditCardNumber)
      - waitForID(creditCardNumber): "Clickable"
      - clickByID(creditCardNumber)
      - waitForID(creditCardNumber): "Clickable"
      - typeByID(creditCardNumber): "35464565463"
      - waitForID(nameOnCard): "Clickable"
      - clickByID(nameOnCard)
      - waitForID(nameOnCard): "Clickable"
      - typeByID(nameOnCard): "jacinto johan"
      - waitForCSS(input.btn.btn-primary): "Clickable"
      - clickByCSS(input.btn.btn-primary)
    - label: Mostrando a confirmação da compra
      actions:
      - waitForLinkText(home): "Clickable"
      - clickByLinkText(home)
      - waitForLinkText(Register): "Clickable"
      - clickByLinkText(Register)
    - label: tela de registro de conta
      actions:
      - waitForID(name): "Clickable"
      - clickByID(name)
      - waitForID(name): "Clickable"
      - typeByID(name): "kayke"
      - waitForID(company): "Clickable"
      - clickByID(company)
      - waitForID(company): "Clickable"
      - typeByID(company): "fecaf"
      - waitForID(email): "Clickable"
      - clickByID(email)
      - waitForID(email): "Clickable"
      - typeByID(email): "kayke.araujo.58173@a.fecaf.com.br"
      - waitForID(password): "Clickable"
      - clickByID(password)
      - waitForID(password): "Clickable"
      - typeSecretByID(password): "Faraujo.76"
      - waitForID(password-confirm): "Clickable"
      - typeSecretByID(password-confirm): "Faraujo.76"
      - waitForCSS(button.btn.btn-primary): "Clickable"
      - clickByCSS(button.btn.btn-primary)

  TESTE FUNCIONAL 10032025-Http:
    headers:
      sec-ch-ua: '"Chromium";v="134", "Not:A-Brand";v="24", "Google Chrome";v="134"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/134.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
      sec-ch-ua-arch: '"x86"'
      sec-ch-ua-platform-version: '"19.0.0"'
      sec-ch-ua-model: '""'
      sec-ch-ua-bitness: '"64"'
      sec-ch-ua-wow64: '?0'
      sec-ch-ua-full-version-list: >-
        "Chromium";v="134.0.6998.36", "Not:A-Brand";v="24.0.0.0", "Google
        Chrome";v="134.0.6998.36"
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/reserve.php
            method: POST
            label: https://blazedemo.com/reserve.php
            think-time: 0ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              fromPort: Paris
              toPort: Buenos Aires
      - transaction: escolhendo destino
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/purchase.php
            method: POST
            label: https://blazedemo.com/purchase.php
            think-time: 19626ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              airline: Virgin America
              flight: '43'
              fromPort: Paris
              price: '472.56'
              toPort: Buenos Aires
      - transaction: colocando informações de compra
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/confirmation.php
            method: POST
            label: https://blazedemo.com/confirmation.php
            think-time: 28768ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              _token: ''
              address: 123 main salin
              cardType: amex
              city: kapolos
              creditCardMonth: '11'
              creditCardNumber: '35464565463'
              creditCardYear: '2017'
              inputName: kayke
              nameOnCard: jacinto johan
              state: unidos fabios
              zipCode: '9998'
      - transaction: Mostrando a confirmação da compra
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/login
            method: GET
            label: https://blazedemo.com/login
            think-time: 17847ms
            headers: {}
          - url: https://blazedemo.com/register
            method: GET
            label: https://blazedemo.com/register
            think-time: 2685ms
            headers: {}
      - transaction: tela de registro de conta
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/register
            method: POST
            label: https://blazedemo.com/register
            think-time: 16155ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              _token: P3d99FM4sFJjVGw7mOz4chqvfR9P7DcGJTwq8njN
              company: fecaf
              email: kayke.araujo.58173@a.fecaf.com.br
              name: kayke
              password: Faraujo.76
              password_confirmation: Faraujo.76